11/data/attachments/86dfff38ee604194.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_a26ceda9-9baa-495d-b3b3-74a127cc4d09</nif:username>
            <nif:friendToBeAdded>Andrew_national_Friend_95443_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>